; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v2 - type_3 ?v4 - type_2)
 	      (pred_4 ?v8 - object ?v4 - type_2)
	      (pred_1 ?v2 - type_3 ?v5 - type_1)
	      (pred_3 ?v2 - type_3 ?v8 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v2 - type_3 ?v1 ?v3 - type_2)
       :precondition (and  (pred_2 ?v2 ?v1))
       :effect (and  (pred_2 ?v2 ?v3)
		     (not (pred_2 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_2 ?v2 ?v7) (pred_1 ?v2 ?v5))
       :effect (and (pred_3 ?v2 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_1 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v6 ?v5) (pred_2 ?v2 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_1 ?v2 ?v5)
		    (not (pred_3 ?v2 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_08 - type_3
obj_10 obj_13 obj_11 obj_12 - type_1
obj_06 obj_05 obj_03 obj_01 - type_2
obj_14 obj_07 obj_04 obj_02 - object)
(:init
(pred_2 obj_09 obj_03)
(pred_1 obj_09 obj_10)
(pred_1 obj_09 obj_13)
(pred_2 obj_08 obj_03)
(pred_1 obj_08 obj_11)
(pred_1 obj_08 obj_12)
(pred_4 obj_14 obj_06)
(pred_4 obj_07 obj_06)
(pred_4 obj_04 obj_06)
(pred_4 obj_02 obj_01)
)
(:goal
(and
(pred_4 obj_14 obj_06)
(pred_4 obj_07 obj_06)
(pred_4 obj_04 obj_03)
(pred_4 obj_02 obj_05)
)
)

(:constraints
  (always (not (pred_2 obj_09 obj_01)))
)
)

; plan
1. (op_1 obj_09 obj_03 obj_06)
   deleted: (pred_2 obj_09 obj_03)
   added: (pred_2 obj_09 obj_06)
   goals met: 2 of 4
2. (op_1 obj_08 obj_03 obj_01)
   deleted: (pred_2 obj_08 obj_03)
   added: (pred_2 obj_08 obj_01)
   goals met: 2 of 4
3. (op_3 obj_08 obj_02 obj_01 obj_12)
   deleted: (pred_4 obj_02 obj_01) (pred_1 obj_08 obj_12)
   added: (pred_3 obj_08 obj_02 obj_12)
   goals met: 2 of 4
4. (op_3 obj_09 obj_04 obj_06 obj_13)
   deleted: (pred_4 obj_04 obj_06) (pred_1 obj_09 obj_13)
   added: (pred_3 obj_09 obj_04 obj_13)
   goals met: 2 of 4
5. (op_1 obj_08 obj_01 obj_05)
   deleted: (pred_2 obj_08 obj_01)
   added: (pred_2 obj_08 obj_05)
   goals met: 2 of 4
6. (op_1 obj_09 obj_06 obj_03)
   deleted: (pred_2 obj_09 obj_06)
   added: (pred_2 obj_09 obj_03)
   goals met: 2 of 4
7. (op_2 obj_09 obj_04 obj_03 obj_13)
   deleted: (pred_3 obj_09 obj_04 obj_13)
   added: (pred_4 obj_04 obj_03) (pred_1 obj_09 obj_13)
   goals met: 3 of 4
8. (op_2 obj_08 obj_02 obj_05 obj_12)
   deleted: (pred_3 obj_08 obj_02 obj_12)
   added: (pred_4 obj_02 obj_05) (pred_1 obj_08 obj_12)
   goals met: 4 of 4
